constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    cylinderSide1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5000;
        startFace       649100;
    }
    cylinderSide2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5000;
        startFace       654100;
    }
    cylinderWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       659100;
    }
    stationaryWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          11200;
        startFace       661600;
    }
    atmosphere
    {
        type            patch;
        nFaces          1600;
        startFace       672800;
    }
)

// ************************************************************************* //
