system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.15 -0.5 0) // 0
    (0 -0.5 0.15) // 1
    (-0.15 -0.5 0)// 2
    (0 -0.5 -0.15)// 3

    (0.15 0.5 0)// 4
    (0 0.5 0.15)// 5
    (-0.15 0.5 0)// 6
    (0 0.5 -0.15)// 7

    (0 -0.5 0) // 8
    (0 0.5 0) // 9

    (1 1 -0.5) //10
    (-1 1 -0.5) //11
    (-1 -1 -0.5) //12
    (1 -1 -0.5) //13
    (1 1 0.5) //14
    (-1 1 0.5) //15
    (-1 -1 0.5) //16
    (1 -1 0.5) //17
);

blocks
(
    // cylinder
    hex (1 0 8 8 5 4 9 9) (25 50 25) simpleGrading (1 1 1)
    hex (2 1 8 8 6 5 9 9) (25 50 25) simpleGrading (1 1 1)
    hex (3 2 8 8 7 6 9 9) (25 50 25) simpleGrading (1 1 1)
    hex (0 3 8 8 4 7 9 9) (25 50 25) simpleGrading (1 1 1)

    // cube
    hex (10 11 12 13 14 15 16 17) (40 40 60) simpleGrading (1 1 1)
);

edges
(
    arc 1 0 (0.10607 -0.5 0.10607)
    arc 5 4 (0.10607 0.5 0.10607)

    arc 2 1 (-0.10607 -0.5 0.10607)
    arc 6 5 (-0.10607 0.5 0.10607)

    arc 3 2 (-0.10607 -0.5 -0.10607)
    arc 7 6 (-0.10607 0.5 -0.10607)

    arc 0 3 (0.10607 -0.5 -0.10607)
    arc 4 7 (0.10607 0.5 -0.10607)
);

boundary
(
    cylinderSide1
    {
        type wall;
        faces
        (
            (0 8 8 1)
            (1 8 8 2)
            (2 8 8 3)
            (3 8 8 0)
        );
    }
    cylinderSide2
    {
        type wall;
        faces
        (
            (5 9 9 4)
            (6 9 9 5)
            (7 9 9 6)
            (4 9 9 7)
        );
    }
    cylinderWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
    
    stationaryWalls
    {
        type wall;
        faces
        (
            (12 11 10 13)
            (10 14 17 13)
            (13 17 16 12)
            (12 16 15 11)
            (11 15 14 10)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (16 17 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
